Website Secondhand Output/statistics.json
{
  "POST /offers.json-0" : {
    "transaction" : "POST /offers.json-0",
    "sampleCount" : 152,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1685.8421052631584,
    "medianResTime" : 1474.5,
    "minResTime" : 205.0,
    "maxResTime" : 4554.0,
    "pct1ResTime" : 2989.000000000001,
    "pct2ResTime" : 3510.45,
    "pct3ResTime" : 4169.749999999999,
    "throughput" : 0.47819042675349593,
    "receivedKBytesPerSec" : 0.6256586915829047,
    "sentKBytesPerSec" : 0.40188788872634607
  },
  "GET /users/{user_id}/offers.json " : {
    "transaction" : "GET /users/{user_id}/offers.json ",
    "sampleCount" : 161,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2029.7204968944088,
    "medianResTime" : 2188.0,
    "minResTime" : 211.0,
    "maxResTime" : 4002.0,
    "pct1ResTime" : 3192.6000000000004,
    "pct2ResTime" : 3544.3,
    "pct3ResTime" : 3910.2399999999993,
    "throughput" : 0.4902139890630519,
    "receivedKBytesPerSec" : 0.6528376272729487,
    "sentKBytesPerSec" : 0.3674731647804085
  },
  "POST /offers.json-1" : {
    "transaction" : "POST /offers.json-1",
    "sampleCount" : 152,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3094.3355263157905,
    "medianResTime" : 2931.5,
    "minResTime" : 954.0,
    "maxResTime" : 6509.0,
    "pct1ResTime" : 4723.700000000001,
    "pct2ResTime" : 4894.65,
    "pct3ResTime" : 6116.2699999999995,
    "throughput" : 0.47530597822348136,
    "receivedKBytesPerSec" : 15.154494475349757,
    "sentKBytesPerSec" : 0.3470984446237265
  },
  "GET /products/{id}.json" : {
    "transaction" : "GET /products/{id}.json",
    "sampleCount" : 153,
    "errorCount" : 9,
    "errorPct" : 5.882353,
    "meanResTime" : 4630.908496732028,
    "medianResTime" : 3811.0,
    "minResTime" : 1129.0,
    "maxResTime" : 8542.0,
    "pct1ResTime" : 7109.4,
    "pct2ResTime" : 7583.399999999999,
    "pct3ResTime" : 8376.220000000003,
    "throughput" : 0.4772644325700222,
    "receivedKBytesPerSec" : 14.364894198585676,
    "sentKBytesPerSec" : 0.6767947911110279
  },
  "GET /categories/{id}.json " : {
    "transaction" : "GET /categories/{id}.json ",
    "sampleCount" : 161,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4165.024844720497,
    "medianResTime" : 3841.0,
    "minResTime" : 1525.0,
    "maxResTime" : 7974.0,
    "pct1ResTime" : 6705.6,
    "pct2ResTime" : 7426.600000000003,
    "pct3ResTime" : 7938.04,
    "throughput" : 0.4900602987237125,
    "receivedKBytesPerSec" : 15.587198558697656,
    "sentKBytesPerSec" : 0.7107277357387887
  },
  "POST /offers.json" : {
    "transaction" : "POST /offers.json",
    "sampleCount" : 161,
    "errorCount" : 9,
    "errorPct" : 5.590062,
    "meanResTime" : 4629.484472049689,
    "medianResTime" : 4133.0,
    "minResTime" : 511.0,
    "maxResTime" : 9263.0,
    "pct1ResTime" : 7255.200000000001,
    "pct2ResTime" : 7729.200000000001,
    "pct3ResTime" : 8923.239999999998,
    "throughput" : 0.4899752882028558,
    "receivedKBytesPerSec" : 15.3877098277326,
    "sentKBytesPerSec" : 0.7495970447794806
  },
  "GET /categories/{id}.json -0" : {
    "transaction" : "GET /categories/{id}.json -0",
    "sampleCount" : 161,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1348.3850931677016,
    "medianResTime" : 1135.0,
    "minResTime" : 150.0,
    "maxResTime" : 3663.0,
    "pct1ResTime" : 2733.6000000000004,
    "pct2ResTime" : 3190.4,
    "pct3ResTime" : 3581.7799999999993,
    "throughput" : 0.49469356652553054,
    "receivedKBytesPerSec" : 0.34396662047478294,
    "sentKBytesPerSec" : 0.363071542944625
  },
  "GET /categories/{id}.json -1" : {
    "transaction" : "GET /categories/{id}.json -1",
    "sampleCount" : 161,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2816.652173913043,
    "medianResTime" : 2605.0,
    "minResTime" : 809.0,
    "maxResTime" : 6965.0,
    "pct1ResTime" : 4434.0,
    "pct2ResTime" : 4807.500000000001,
    "pct3ResTime" : 5909.759999999992,
    "throughput" : 0.49247522329621923,
    "receivedKBytesPerSec" : 15.321585149845527,
    "sentKBytesPerSec" : 0.3527866383595375
  },
  "DELETE /products/{id}.json " : {
    "transaction" : "DELETE /products/{id}.json ",
    "sampleCount" : 142,
    "errorCount" : 1,
    "errorPct" : 0.70422536,
    "meanResTime" : 5216.584507042249,
    "medianResTime" : 4081.0,
    "minResTime" : 115.0,
    "maxResTime" : 9224.0,
    "pct1ResTime" : 8287.7,
    "pct2ResTime" : 8661.599999999999,
    "pct3ResTime" : 9139.72,
    "throughput" : 0.45210691373354345,
    "receivedKBytesPerSec" : 14.280422820454655,
    "sentKBytesPerSec" : 0.6711335108330548
  },
  "GET /products.json" : {
    "transaction" : "GET /products.json",
    "sampleCount" : 158,
    "errorCount" : 5,
    "errorPct" : 3.164557,
    "meanResTime" : 2023.3987341772156,
    "medianResTime" : 1846.5,
    "minResTime" : 241.0,
    "maxResTime" : 4148.0,
    "pct1ResTime" : 3162.6999999999994,
    "pct2ResTime" : 3466.35,
    "pct3ResTime" : 4049.4699999999993,
    "throughput" : 0.49001972484462036,
    "receivedKBytesPerSec" : 4.79774232328276,
    "sentKBytesPerSec" : 0.3804685513171606
  },
  "POST /products.json " : {
    "transaction" : "POST /products.json ",
    "sampleCount" : 160,
    "errorCount" : 10,
    "errorPct" : 6.25,
    "meanResTime" : 2475.281249999999,
    "medianResTime" : 2311.0,
    "minResTime" : 478.0,
    "maxResTime" : 4860.0,
    "pct1ResTime" : 3845.3,
    "pct2ResTime" : 4104.45,
    "pct3ResTime" : 4681.879999999996,
    "throughput" : 0.4935590543408519,
    "receivedKBytesPerSec" : 1.1013440133600267,
    "sentKBytesPerSec" : 1.7085264832991955
  },
  "POST /users/sign_in.json" : {
    "transaction" : "POST /users/sign_in.json",
    "sampleCount" : 161,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1524.2484472049694,
    "medianResTime" : 1307.0,
    "minResTime" : 241.0,
    "maxResTime" : 3768.0,
    "pct1ResTime" : 2901.800000000002,
    "pct2ResTime" : 3045.9,
    "pct3ResTime" : 3619.819999999999,
    "throughput" : 0.4975893188280381,
    "receivedKBytesPerSec" : 1.0228613896958834,
    "sentKBytesPerSec" : 0.39136747241624426
  },
  "PUT /offers/{id}.json -0" : {
    "transaction" : "PUT /offers/{id}.json -0",
    "sampleCount" : 160,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1837.9687499999993,
    "medianResTime" : 1851.5,
    "minResTime" : 278.0,
    "maxResTime" : 4476.0,
    "pct1ResTime" : 3224.9,
    "pct2ResTime" : 3483.95,
    "pct3ResTime" : 4324.719999999997,
    "throughput" : 0.49270792274339775,
    "receivedKBytesPerSec" : 0.6444898702330508,
    "sentKBytesPerSec" : 0.3992064900411411
  },
  "PUT /offers/{id}.json -1" : {
    "transaction" : "PUT /offers/{id}.json -1",
    "sampleCount" : 160,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2938.9999999999995,
    "medianResTime" : 2766.0,
    "minResTime" : 903.0,
    "maxResTime" : 5480.0,
    "pct1ResTime" : 4554.8,
    "pct2ResTime" : 4802.55,
    "pct3ResTime" : 5425.0999999999985,
    "throughput" : 0.49154239860401955,
    "receivedKBytesPerSec" : 15.321107152210713,
    "sentKBytesPerSec" : 0.3587923494497798
  },
  "GET /products/{id}.json-0" : {
    "transaction" : "GET /products/{id}.json-0",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1823.6733333333336,
    "medianResTime" : 1658.5,
    "minResTime" : 272.0,
    "maxResTime" : 3715.0,
    "pct1ResTime" : 3012.1,
    "pct2ResTime" : 3295.399999999999,
    "pct3ResTime" : 3704.29,
    "throughput" : 0.46931023909792313,
    "receivedKBytesPerSec" : 0.3263172756227747,
    "sentKBytesPerSec" : 0.3499477794586037
  },
  "GET /products/{id}.json-1" : {
    "transaction" : "GET /products/{id}.json-1",
    "sampleCount" : 150,
    "errorCount" : 6,
    "errorPct" : 4.0,
    "meanResTime" : 2862.4133333333343,
    "medianResTime" : 2547.0,
    "minResTime" : 783.0,
    "maxResTime" : 5533.0,
    "pct1ResTime" : 4705.1,
    "pct2ResTime" : 5019.299999999999,
    "pct3ResTime" : 5508.01,
    "throughput" : 0.46957322055228073,
    "receivedKBytesPerSec" : 14.070465013468924,
    "sentKBytesPerSec" : 0.32906199423051036
  },
  "PUT /profiles.json " : {
    "transaction" : "PUT /profiles.json ",
    "sampleCount" : 141,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1859.0709219858152,
    "medianResTime" : 1675.0,
    "minResTime" : 245.0,
    "maxResTime" : 4755.0,
    "pct1ResTime" : 3240.3999999999996,
    "pct2ResTime" : 3970.0,
    "pct3ResTime" : 4639.080000000004,
    "throughput" : 0.4918856313578835,
    "receivedKBytesPerSec" : 0.7810844301190991,
    "sentKBytesPerSec" : 1.6202682172111131
  },
  "PUT /products/{id}.json -0" : {
    "transaction" : "PUT /products/{id}.json -0",
    "sampleCount" : 142,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2003.7394366197182,
    "medianResTime" : 1762.0,
    "minResTime" : 776.0,
    "maxResTime" : 4655.0,
    "pct1ResTime" : 3240.8000000000006,
    "pct2ResTime" : 3724.899999999999,
    "pct3ResTime" : 4594.799999999999,
    "throughput" : 0.4517372797780761,
    "receivedKBytesPerSec" : 0.3140985773456936,
    "sentKBytesPerSec" : 0.34502876246254083
  },
  "PUT /products/{id}.json -1" : {
    "transaction" : "PUT /products/{id}.json -1",
    "sampleCount" : 142,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3223.1690140845085,
    "medianResTime" : 2643.0,
    "minResTime" : 998.0,
    "maxResTime" : 6989.0,
    "pct1ResTime" : 5261.9000000000015,
    "pct2ResTime" : 5961.149999999999,
    "pct3ResTime" : 6760.669999999996,
    "throughput" : 0.44948514958042773,
    "receivedKBytesPerSec" : 13.981047509116319,
    "sentKBytesPerSec" : 0.3279453642095867
  },
  "DELETE /products/{id}.json -1" : {
    "transaction" : "DELETE /products/{id}.json -1",
    "sampleCount" : 141,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3185.971631205675,
    "medianResTime" : 2725.0,
    "minResTime" : 893.0,
    "maxResTime" : 6245.0,
    "pct1ResTime" : 5472.2,
    "pct2ResTime" : 5758.8,
    "pct3ResTime" : 6231.56,
    "throughput" : 0.49144844845193736,
    "receivedKBytesPerSec" : 15.284372146287822,
    "sentKBytesPerSec" : 0.35823550292429257
  },
  "PUT /offers/{id}.json " : {
    "transaction" : "PUT /offers/{id}.json ",
    "sampleCount" : 161,
    "errorCount" : 1,
    "errorPct" : 0.621118,
    "meanResTime" : 4749.07453416149,
    "medianResTime" : 4380.0,
    "minResTime" : 251.0,
    "maxResTime" : 8515.0,
    "pct1ResTime" : 7105.400000000001,
    "pct2ResTime" : 7338.400000000001,
    "pct3ResTime" : 8370.539999999999,
    "throughput" : 0.49015279980759224,
    "receivedKBytesPerSec" : 15.826259241739708,
    "sentKBytesPerSec" : 0.7502253827606258
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3978,
    "errorCount" : 203,
    "errorPct" : 5.103067,
    "meanResTime" : 2787.510809451986,
    "medianResTime" : 2409.0,
    "minResTime" : 115.0,
    "maxResTime" : 9458.0,
    "pct1ResTime" : 5306.199999999999,
    "pct2ResTime" : 6714.249999999998,
    "pct3ResTime" : 8197.36,
    "throughput" : 11.751776946665013,
    "receivedKBytesPerSec" : 180.5337174198749,
    "sentKBytesPerSec" : 13.292122812420606
  },
  "PUT /products/{id}.json " : {
    "transaction" : "PUT /products/{id}.json ",
    "sampleCount" : 144,
    "errorCount" : 2,
    "errorPct" : 1.3888888,
    "meanResTime" : 5171.229166666669,
    "medianResTime" : 4055.5,
    "minResTime" : 1010.0,
    "maxResTime" : 9458.0,
    "pct1ResTime" : 8200.5,
    "pct2ResTime" : 8569.5,
    "pct3ResTime" : 9333.800000000003,
    "throughput" : 0.4531821886811454,
    "receivedKBytesPerSec" : 14.226744736674398,
    "sentKBytesPerSec" : 0.6673754358731467
  },
  "DELETE /products/{id}.json -0" : {
    "transaction" : "DELETE /products/{id}.json -0",
    "sampleCount" : 141,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2066.7234042553187,
    "medianResTime" : 1896.0,
    "minResTime" : 201.0,
    "maxResTime" : 5191.0,
    "pct1ResTime" : 3370.2,
    "pct2ResTime" : 3987.9,
    "pct3ResTime" : 4985.200000000006,
    "throughput" : 0.49426165721376647,
    "receivedKBytesPerSec" : 0.343666308531447,
    "sentKBytesPerSec" : 0.3786278991863962
  },
  "GET /categories.json " : {
    "transaction" : "GET /categories.json ",
    "sampleCount" : 161,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1368.4782608695648,
    "medianResTime" : 1305.0,
    "minResTime" : 241.0,
    "maxResTime" : 3472.0,
    "pct1ResTime" : 2453.2000000000003,
    "pct2ResTime" : 2792.4000000000005,
    "pct3ResTime" : 3471.38,
    "throughput" : 0.495081473190262,
    "receivedKBytesPerSec" : 0.5173214612437308,
    "sentKBytesPerSec" : 0.3619058061371652
  },
  "POST /users.json" : {
    "transaction" : "POST /users.json",
    "sampleCount" : 161,
    "errorCount" : 160,
    "errorPct" : 99.37888,
    "meanResTime" : 2307.316770186336,
    "medianResTime" : 2157.0,
    "minResTime" : 700.0,
    "maxResTime" : 5168.0,
    "pct1ResTime" : 3595.8,
    "pct2ResTime" : 3920.100000000001,
    "pct3ResTime" : 4941.079999999998,
    "throughput" : 0.4996384603687394,
    "receivedKBytesPerSec" : 0.3075614394320259,
    "sentKBytesPerSec" : 0.5091242691623763
  },
  "GET /profiles.json" : {
    "transaction" : "GET /profiles.json",
    "sampleCount" : 141,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1596.879432624113,
    "medianResTime" : 1367.0,
    "minResTime" : 194.0,
    "maxResTime" : 4227.0,
    "pct1ResTime" : 2958.9999999999995,
    "pct2ResTime" : 3550.6000000000004,
    "pct3ResTime" : 4031.7000000000057,
    "throughput" : 0.48926055727124473,
    "receivedKBytesPerSec" : 0.7763704066761512,
    "sentKBytesPerSec" : 0.36369913295048406
  }
}